# Learn CSV

In [5]:
from io import StringIO
import pandas as pd

In [7]:
# Jis Folder se use kr rhe ho usi me ek csv file lo and then usko read krne le liye statement likho.
df=pd.read_csv('CSV_01.csv')
df.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [9]:
# first create a dataframe then we will execute it.
data = ('col1,col2,col3\n'
       'x,4,1\n'
       'a,b,2\n'
       'c,d,3')

In [11]:
# First let us know that dataframe is str or not.
type(data)

str

In [13]:
# In meoeory file format object
StringIO(data)

In [15]:
# Then again read this File.
df1=pd.read_csv(StringIO(data))
df1.head()

  col1 col2  col3
0    x    4     1
1    a    b     2
2    c    d     3

Jo Naya CSV banaye agr usme sirf Specific column wise read krna hai to kya kr sakte hai.

In [17]:
df1=pd.read_csv(StringIO(data),usecols=['col1','col2'])
df1.head()

  col1 col2
0    x    4
1    a    b
2    c    d

Bade Wale CSV file Ko seperatly Column wise kaise print kare

In [19]:
df2=pd.read_csv('CSV_01.csv',usecols=['Series_reference','Data_value','STATUS'])
df2.head()

  Series_reference  Data_value STATUS
0      BDCQ.SEA1AA     80078.0      F
1      BDCQ.SEA1AA     78324.0      F
2      BDCQ.SEA1AA     85850.0      F
3      BDCQ.SEA1AA     90743.0      F
4      BDCQ.SEA1AA     81780.0      F

Acha Jo abhi hm Naya Dataframe banaye df2 ke naam se agar usko ek CSV file se save krna hoga to.

In [21]:
#df2.to_csv('Part_of_CSV_01_with_no_index.csv',index=False)
# Agar index=False nhi kiye to index to Show karega.

In [25]:
# This will Give us only null values in our df2
df2.isnull().sum()

Series_reference       0
Data_value          2839
STATUS                 0
dtype: int64

In [52]:
# Apne Hisaab se dtype change kr sakte hai kya !!!
# First Create a data type:
data2 = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11,12')
df3=pd.read_csv(StringIO(data2))
df3.head()

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [50]:
# Now changing dtypes
df3=pd.read_csv(StringIO(data2),dtype={'a':int,'b':float,'c':str})
df3.head()
# As we can See This is our choice that what we want as in position of dtype

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

# Agar koi link pr Data frame hai aur usko csv format me banana hai tb
pd.read_csv('paste the link',sep='\t').t0_csv('Your file name')